class Matcher

  def self.rename_street street
    streets = {
        '' => ''
    }
    streets[street].blank? ? street : streets[street]
  end

  def self.escape str
    return str.to_s
         .gsub(/(?<=^|\s)(п|П)(о|О)(с|С).?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(о|О)(с|С)(т|Т).?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(у|У)(л|Л)\.?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(с|С)(т|Т)\.?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(д|Д)(н|Н)(т|Т)(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(с|С)(н|Н)(т|Т)(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(с|С)(т|Т)(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(к|К)(п|П)(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(ж|Ж)(к|К)(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(х|Х)\.?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(с|С)\.?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(п|П)\.?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(д|Д)\.?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(р|Р)\-(н|Н)(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/(?<=^|\s)(г|Г).?(?=\s|[А-Я\/,]|$)/, '')
         .gsub(/\./i, '')
         .strip
  end

  def self.rename_district district
    district = district.to_s.strip
    hash_list =
    {
      'Область' => [Location.where(title: 'обл Ростовская').first],

      'Азов' => 'г Азов',
      'Аксай' => [Location.where(title: 'обл Ростовская').first, Location.where(title: 'р-н Аксайский').first, Location.where(title: 'г Аксай').first],

      'Азовский р-н' => 'р-н Азовский',
      'Аксайский р-н' => 'р-н Аксайский',
      'Батайск' => 'г Батайск',

      '1 Ордж.' => 'Орджоникидзе',
      '2 Ордж.' => 'Орджоникидзе',
      '1 Ордж' => 'Орджоникидзе',
      '2 Ордж' => 'Орджоникидзе',
      'Зооп.' => 'Зоопарк',
      'Военв.' => 'Военвед',
      'Алекс.' => 'Александровка',
      'Ленина' => 'Ленина площадь',
      'Левенц' => 'Ливенцовка',
      'Неклиновский р-н' => 'р-н Неклиновский',
      'Мясниковский р-н' => 'р-н Мясниковский',
      'Кагальницкий р-н' => 'р-н Кагальницкий',
      'Рост. море' => 'Ростовское море',
      '40 лет Победы' => 'пр-кт 40-летия Победы',
      'Шолохова' => 'пр-кт Шолохова',
    }
    hash_list[district].blank? ? district : hash_list[district]
  end
end