class Matcher

  def self.rename_street street
    streets = {
        '' => ''
    }
    streets[street].blank? ? street : streets[street]
  end

  def self.escape str
    return str.to_s
         .gsub(/(?<=^|\s)(п|П)(о|О)(с(?=\s|[А-Я\/,\.]|$)|С(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/(?<=^|\s)(о|О)(с|С)(т(?=\s|[А-Я\/,\.]|$)|Т(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/(?<=^|\s)(у|У)(л(?=\s|[А-Я\/,\.]|$)|Л(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/(?<=^|\s)(с|С)(т(?=\s|[А-Я\/,\.]|$)|Т(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/(?<=^|\s)(д|Д)(н|Н)(т(?=\s|[А-Я\/,]|$)|Т(?=\s|[а-я\/,]|$))/, '')
         .gsub(/(?<=^|\s)(с|С)(н|Н)(т(?=\s|[А-Я\/,]|$)|Т(?=\s|[а-я\/,]|$))/, '')
         .gsub(/(?<=^|\s)(с|С)(т(?=\s|[А-Я\/,]|$)|Т(?=\s|[а-я\/,]|$))/, '')
         .gsub(/(?<=^|\s)(к|К)(п(?=\s|[А-Я\/,]|$)|П(?=\s|[а-я\/,]|$))/, '')
         .gsub(/(?<=^|\s)(ж|Ж)(к(?=\s|[А-Я\/,]|$)|К(?=\s|[а-я\/,]|$))/, '')
         .gsub(/(?<=^|\s)(р|Р)\-(н(?=\s|[А-Я\/,]|$)|Н(?=\s|[а-я\/,]|$))/, '')
         .gsub(/(?<=^|\s)(г(?=\s|[А-Я\/,\.]|$)|Г(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/(?<=^|\s)(х(?=\s|[А-Я\/,\.]|$)|Х(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/(?<=^|\s)(с(?=\s|[А-Я\/,\.]|$)|С(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/(?<=^|\s)(п(?=\s|[А-Я\/,\.]|$)|П(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/(?<=^|\s)(д(?=\s|[А-Я\/,\.]|$)|Д(?=\s|[а-я\/,\.]|$))/, '')
         .gsub(/\./i, '')
         .strip
  end



  def self.rename_district district
    district = district.to_s.strip
    hash_list =
    {
      'Область' => [Location.where(title: 'обл Ростовская').first],

      'Азов' => 'г Азов',
      'Аксай' => [Location.where(title: 'обл Ростовская').first, Location.where(title: 'р-н Аксайский').first, Location.where(title: 'г Аксай').first],

      'Азовский р-н' => 'р-н Азовский',
      'Аксайский р-н' => 'р-н Аксайский',
      'Батайск' => 'г Батайск',

      '1 Ордж.' => 'Орджоникидзе',
      '2 Ордж.' => 'Орджоникидзе',
      '1 Ордж' => 'Орджоникидзе',
      '2 Ордж' => 'Орджоникидзе',
      'Зооп.' => 'Зоопарк',
      'Военв.' => 'Военвед',
      'Алекс.' => 'Александровка',
      'Ленина' => 'Ленина площадь',
      'Левенц' => 'Ливенцовка',
      'Неклиновский р-н' => 'р-н Неклиновский',
      'Мясниковский р-н' => 'р-н Мясниковский',
      'Кагальницкий р-н' => 'р-н Кагальницкий',
      'Рост. море' => 'Ростовское море',
      '40 лет Победы' => 'пр-кт 40-летия Победы',
      'Шолохова' => 'пр-кт Шолохова',
    }
    value = hash_list[district]
    return value.blank? ? Matcher.escape(district) : value
  end
end